<?php
	$x = 10;
	$y = 0;
	$b_1 = $x > 10;
	$b_2 = $y == 0;
	echo "x = $x; y = $y<br/>";
	echo "x > 10 = $b_1; (y == 0) = $b_2<br/>";	

	$b_1 = true;
	$b_2 = false;
	echo "b_1 = $b_1; b_2 = $b_2<br/>";
	echo 'Отрицание b_1: '.!$b_1.'<br/>';
	echo 'b_1 ИЛИ b_2: '.($b_1 || $b_2).'<br/>';
	echo 'b_1 И b_2: '.($b_1 && $b_2).'<br/>';
	echo 'b_1 ИСКЛЮЧАЮЩЕЕ ИЛИ b_2: '.($b_1 xor $b_2).'<br/>';

	echo (!($b_1 && $b_2) xor (!$b_1 || $x < 10)). '<br/>';

	$x = 5;
	$y = '5';
	echo 'Результат проверки на равенство x и y '.($x == $y).'<br/>';
	echo 'Результат проверки на эквивалентность x и y '.($x === $y).'<br/>';
?>
